'''--------------------------------------------------------------
---------------------- 함수 : 인수키워드로 매칭 -------------------------     
==============================================================='''



'''-------------  (1) 함수에서 Argument에 초기값을 줄 수 있다. -----------'''
print("\n\n ===== <실습1> ===== \n")
def ShowGugu(start=1, end=5):
    for dan in range(start, end + 1):
        print(str(dan) + '단 출력')

print("--<실습1-결과(1)>--")        
ShowGugu(2, 3)

print("--<실습1-결과(2)>--") 
ShowGugu(2)

print("--<실습1-결과(3)>--") 
ShowGugu()

print("--<실습1-결과(4)>--") 
ShowGugu(start=2, end=4)

print("--<실습1-결과(5)>--") 
ShowGugu(end=4, start=2)

print("--<실습1-결과(6)>--") 
ShowGugu(2, end=4)
"""--------------------- <실습1-설명> ---------------------
1) 함수에서 Argument 사용시 자주  사용하게 되는 방법들에 대해 정리.  

2) 주의사항.

print("\n<실습1-결과(6)>") 
ShowGugu(2, end=4)
가 된다고 해서

print("\n<실습1-결과(7)>") 
ShowGugu(start=2, 4)
를 사용하게 되면 

SyntaxError: positional argument follows keyword argument
를 만난다.

========================================================"""



'''---------------------  (2) 가변 인수 -------------------'''
print("\n\n ===== <실습2> ===== \n")

def func1 (*ar):
    print(ar)
    
func1('a')
func1('a','b')
func1()

def func2 (a, *ar):
    print(a)
    print(ar)

print("--<실습2-결과(1)>--") 
func2('a')
print("--<실습2-결과(2)>--") 
func2('a', 'b')
print("--<실습2-결과(3)>--") 
func2('a', 'b', 'c')

"""--------------------- <실습2-설명> ---------------------
1) ('a') 이거는 Tuple이 아니다.

2) 때문에, func2의 출력 결과를 보면 ()밖으로 a가 나와 있는것을 확인 할 수 있다. 
 
========================================================"""




'''---------------------  (2) 가변 인수. -------------------'''
print("\n\n ===== <실습3> ===== \n")
def func3(a, *b, **c):
    print(a)
    print(b)
    print(c)

print("--<실습3-결과(1)>--") 
func3(1)
print("--<실습3-결과(2)>--") 
func3(1,2,3,4,5)
print("--<실습3-결과(3)>--") 
func3(1,2,3, m=6, n=7)
    
"""--------------------- <실습3-설명> ---------------------
1) (a, *b, **c) 일떄,
    - 별이 없는 a는 (일반 인자)를 야기하며,
    - 별이 하나인 b는 Tuple이고,
    - 별이 두개인 c는 dict가 된다.

========================================================"""

'''======================================================='''
