'''--------------------------------------------------------------
----------------- 다른 클래스 참조하기  ------------------
--------------------------------------------------------------'''

print('일반 작업 하다가')


# 다른 모듈에 만들었다고 가정
class Robot:
    name = '태권V'
    energy = 15
    
    def attack(self):
        return '발차기'
        
# ------------------------------
        
robot1 = Robot() # 생성 객체를 치환 (__init__은 자동으로 생성됨.)
print('이름: ', robot1.name)
print('공격 필살기: ', robot1.attack())

print('robot2')
robot2 = Robot # 원형 클래스를 치환
print('이름: ', robot2.name)
# print('공격 필살기: ', robot2.attack()) #Err
